app/controllers/api/v1/books_controller.rb

  def index
    render json: Book.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "books".* FROM "books" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]